console.log('start');
let a = [34, 45, 2, 4, 575, 65, -45];     //обявляємо масів

console.log(a);

let max = a[0];
for (let i = 0; i < a.length; i++) {       //находим максимальне значення
    if (a[i] > max) {
        max = a[i];
    }
}
console.log(max);

let sum = 0;
for (let i = 0; i < a.length; i++) {       //находим сумму
    sum += a[i];
}
console.log(sum);

let buff = a[0];
a[0] = a[a.length - 1];                   //міняємо місцями 1-й та останній елементи місцями
a[a.length - 1] = buff;
console.log(a);

//push pop splise shift unshift  


a.push(10, 69);           //  добавляє елементи в кінець массіва може відразу вернуть довжину массіва якщо присвоїть змінній (let b = a.push(10);)
console.log(a);            //   добавляє елементи в початок массіва може відразу вернуть довжину массіва якщо присвоїть змінній (let b = a.shift(10);)
a.shift(0);
console.log(a);


a.pop();       //удаляє останній елемент. Вертає елемент який був удалений
a.unshift();   // удаляє перший елемент. Вертає елемент який був удалений

delete a[3];
console.log(a);   // удаляє конкретне значення по індексу. Замість нього в масіві дирка( дліна масіва не міняється)

a.splice(3, 2);   // удаляє елементи( 1-й параметр початковий індека, 2-й кількість елементів)
console.log(a);

a.splice(3, 2, 'addd', 'ad2');  // також удаляє але на місце удалених вставляє нові елементи які вказані після двох обовязкових параметрів
console.log(a);

// двухмірний масів

let c = [            //
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]
console.log(c);

// асоціатівний масів

let d = {
    "one": 1,      // замість індекса тут строка (key)
    "two": 2,
    "three": 3
}
console.log(d);
console.log(d.two); // звертаємося по ключу
let k = 'three';
console.log(d[k]); // якщо ключ в змінній то беремо в []
d.four = 7;       // добавляє новий елемент .key = new perem
console.log(d);

for (let key in d) {       // перебераєм циклом ключі масіва d
    console.log(d[key]);  // виводим елементи по ключам( можно вивести і ключі)
}

delete d.one;     // удаляєм елемент по ключу
console.log(d);

console.log("_____________");

//set

let e = new Set();     // обявленіє
e.add(1);
e.add(2);
e.add('text');
e.add(1);                // не добавить так як сет це колекція унікальних елементів( не можуть повторюватись)
e.add("1");              // але строку добавить
console.log(e);
console.log(e.size);      //довжина
//e.clear();
//console.log(e);       // очищаєм повністю
e.delete('text');      //удаляєм конкретний елемент
console.log(e);
console.log(e.has(2));   // провіряє наявність елемента
console.log(e.has(6));

for (let item of e) {       // перебор елементів і вивід в консоль
    console.log(item);
}

let f = [1, 4, 5, 7, 34, 4, 4, 78, 4, 6, 435, 765, 3, 435];   //обичний масів
let g = new Set(f);      //создали з нього set і як наслідок повторюючі елементи пропали (з масіва робим сет)
console.log(g);

let gArr = Array.from(g);  //з сета робим масів
console.log(gArr);



